app/controllers/articles_controller.rb

	def create
		@article=Article.new(article_params)
		@article.save
---
INSERT INTO "articles" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Learn Web Development"], ["created_at", "2015-07-17 00:53:28.117205"], ["updated_at", "2015-07-17 00:53:28.117205"]]

	def destroy
		@article=Article.find(params[:id]).destroy
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 5]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 5]]